### Arithmetic methods with fill values

In arithmetic operations with differently indexed objects, you might want to fill a special value, like 0, where an index is found in one but not the other. This can be done using np.nan

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)),columns= list('abcd'))

In [3]:
df2 = pd.DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))

In [4]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [5]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [6]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [7]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [8]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [9]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [10]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [11]:
df1.reindex(columns=df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [12]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [13]:
df1.radd(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [14]:
df1.sub(df2)

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [15]:
df1.floordiv(df2)

     a    b    c    d   e
0  NaN  1.0  1.0  1.0 NaN
1  0.0  0.0  0.0  0.0 NaN
2  0.0  0.0  0.0  0.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [16]:
df1.pow(df2)

              a             b             c             d   e
0  1.000000e+00  1.000000e+00  4.000000e+00  2.700000e+01 NaN
1  1.024000e+03  1.562500e+04  2.799360e+05  5.764801e+06 NaN
2  1.073742e+09  3.138106e+10  1.000000e+12  3.452271e+13 NaN
3           NaN           NaN           NaN           NaN NaN

### Operations between DataFrame and Series

As with Numpy arrays of different dimensions, arithmetic operations between Dataframe and Series is also defined.

In [17]:
arr = np.arange(12.).reshape((3,4))

In [18]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [19]:
arr[0]

array([0., 1., 2., 3.])

In [20]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

When we subtract arr[0] from arr, the subtraction is performed once for each row. This is also called as broadcasting.

In [21]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [22]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [23]:
series = frame.iloc[0]

In [24]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

By default arithmetic between dataframe and series matches the index of the series on the data frame columns

In [25]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an object is not found in either dataframe or series, the object will be reindexed to form the union.

In [26]:
series2 = pd.Series(range(3),index=list('bef'))

In [27]:
series2

b    0
e    1
f    2
dtype: int64

In [28]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [29]:
# if you want to braodcast over columns
series3= frame['d']

In [30]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [31]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [32]:
frame.sub(series3,axis='index') # we mean axis to match on the data frame's row index

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

Numpy ufuncs also work with pandas objects

In [33]:
frame = pd.DataFrame(np.random.randn(4,3),index = ['Oregon','Texas','Utah','Ohio'],columns=list('bde'))

In [34]:
frame

               b         d         e
Oregon  0.418395  0.221977 -1.576340
Texas   1.383173 -0.256506  0.081618
Utah    0.014427  1.402960 -1.224230
Ohio   -0.226992 -0.439341 -1.118887

In [35]:
np.abs(frame)

               b         d         e
Oregon  0.418395  0.221977  1.576340
Texas   1.383173  0.256506  0.081618
Utah    0.014427  1.402960  1.224230
Ohio    0.226992  0.439341  1.118887

Another method is "apply()" that applies a function on one-dimensional array to every row or column.

In [36]:
f=  lambda x: x.max()-x.min()

In [37]:
frame.apply(f)

b    1.610165
d    1.842301
e    1.657958
dtype: float64

In [38]:
frame.apply(f,axis=1)

Oregon    1.994735
Texas     1.639679
Utah      2.627190
Ohio      0.891895
dtype: float64

In [39]:
frame.apply(f,axis='columns')

Oregon    1.994735
Texas     1.639679
Utah      2.627190
Ohio      0.891895
dtype: float64

In [40]:
def f(x):
    return pd.Series([x.max(),x.min()], index=['min','max'] ) 
# need not only return a scalar value can also return a pandas series

In [41]:
frame.apply(f)

            b         d         e
min  1.383173  1.402960  0.081618
max -0.226992 -0.439341 -1.576340

In [42]:
# you want to compute a formatted string from each floating-point value in frame. 
format = lambda x: '%.2f' %x

In [43]:
frame

               b         d         e
Oregon  0.418395  0.221977 -1.576340
Texas   1.383173 -0.256506  0.081618
Utah    0.014427  1.402960 -1.224230
Ohio   -0.226992 -0.439341 -1.118887

In [44]:
frame['e'].map(format)

Oregon    -1.58
Texas      0.08
Utah      -1.22
Ohio      -1.12
Name: e, dtype: object

In [45]:
frame.map(format)

            b      d      e
Oregon   0.42   0.22  -1.58
Texas    1.38  -0.26   0.08
Utah     0.01   1.40  -1.22
Ohio    -0.23  -0.44  -1.12

### Sorting and Ranking

To sort lexicographically by row or by column index, use the sort_index method, which returns a new sorted object

In [46]:
obj = pd.Series(range(4),index=list('dabc'))

In [47]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [48]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [49]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])

In [50]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [51]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [52]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [53]:
obj = pd.Series([4,7,-3,2])

In [54]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [55]:
# any missing values are sorted to the end by default
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [56]:
# when sorting a dataframe you can use data in one or more columns as the sort keys. pass by option in sort_values
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1,0, 1]})

In [57]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [58]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [59]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array.

In [60]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [61]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [62]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [63]:
obj.rank(method='first') # rank can also be defined according to the order in which they are observed in the data 
# here instead of using the average rank they are put in order of their observation in the data

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [64]:
# you can rank in descending order 
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [65]:
# data frame can compute ranks over rows or columns
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1,0, 1],'c': [-2, 5, 8, -2.5]})

In [66]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [67]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

#### Axis Indexes With duplicate labels

In [68]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b','c'])

In [69]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [70]:
obj.index.is_unique

False

In [71]:
obj['a']

a    0
a    1
dtype: int64

In [72]:
obj['c']

4

In [73]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a','a', 'b', 'b', 'c'])

In [74]:
df

          0         1         2
a  2.448873 -0.807349 -0.193164
a -1.078141 -2.178453 -0.838562
b  0.886210 -0.100897 -0.526505
b  0.317571  0.289235  0.687816
c -0.597335  0.900253 -0.455168

In [75]:
df.loc['b']

          0         1         2
b  0.886210 -0.100897 -0.526505
b  0.317571  0.289235  0.687816

In [76]:
df.loc['c']

0   -0.597335
1    0.900253
2   -0.455168
Name: c, dtype: float64

### Summarizing and Computing Descriptive Statistics

In [77]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [78]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [79]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [80]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [81]:
df.sum(axis='columns',skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [82]:
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [83]:
# index where maximum and minimum value are attained

df.idxmax()

one    b
two    d
dtype: object

In [84]:
df.idxmin()

one    d
two    b
dtype: object

In [85]:
# accumulations
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [86]:
# producing multiple summary statistics in one shot

df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [87]:
obj = pd.Series(list('aabc')*4)

In [88]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [89]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [90]:
df.median()

one    1.4
two   -2.9
dtype: float64

In [91]:
df.prod()

one    7.455
two    5.850
dtype: float64

In [92]:
df.var()

one    12.205833
two     5.120000
dtype: float64

In [93]:
df.std()

one    3.493685
two    2.262742
dtype: float64

In [94]:
df.skew()

one    1.664846
two         NaN
dtype: float64

In [95]:
df.kurt()

one   NaN
two   NaN
dtype: float64

#### Correlation and Covariance

In [96]:
price = pd.read_pickle('C:/Users/HP/Desktop/Shrey/Projects/Python/Data analysis with python By Wes Mckinney/data/yahoo_price.pkl')

In [97]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [98]:
volume = pd.read_pickle('C:/Users/HP/Desktop/Shrey/Projects/Python/Data analysis with python By Wes Mckinney/data/yahoo_volume.pkl')

In [99]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [100]:
returns = price.pct_change()

In [101]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [102]:
returns['MSFT'].corr(returns['IBM'])

0.49976361144151155

In [103]:
returns['MSFT'].cov(returns['IBM'])

8.870655479703549e-05

In [104]:
returns.MSFT.cov(returns.IBM)

8.870655479703549e-05

In [105]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [106]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [107]:
# pairwise correlation
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [108]:
returns.corrwith(volume) # passing data frames computer correlation of similar column names

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

Passing axis = 'columns' does things row by row instead

#### Unique values, Value counts, Membership

In [109]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b','c', 'c'])

In [110]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [111]:
uniques = obj.unique()

In [112]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [113]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [114]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

isin performs a vectorized set membership check and can be useful in filtering the dataset down to the subset of values in a series or a column in a dataframe

In [115]:
mask = obj.isin(['b','c'])

In [116]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [117]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [118]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})

In [119]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [120]:
result = data.apply(pd.value_counts).fillna(0)

C:\Users\HP\AppData\Local\Temp\ipykernel_39500\2451317050.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [121]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [122]:
data = pd.DataFrame({'a': [1, 1, 1, 2, 2], 'b': [0, 0,1, 0, 0]})

In [123]:
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [124]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64